import React from "react";
import "../styles/Biography.css";
import edwardImg from "../assets/images/edward.png";

function Biography() {
  React.useEffect(() => {document.title = "Біографія"}, []);
  return (
    <div className="page">
      <div className="container-biography">
        <p>
          <h2>Біографія Едварда Мунка</h2>
          Народився 12 грудня 1863 року в Летені у провінції Гедмарк. Хлопець
          рано лишився сиротою — коли Едварду було 5 років (1868 рік), померла
          його мати. У 1881-86 роках навчався в Королівській школі малювання у
          Християнії (Кристианія, сучасне Осло). Під час навчання познайомився з
          представниками міської інтелігенції, зокрема, у 1884 році з Гансом
          Єґером (Hans Jæger), очільником міської богеми. У цей же період почав
          виставляти свої роботи. Так, у 1885 році одна картина Мунка
          експонувалася на Світовій виставці у Антверпені, а сам Мунк уперше
          відвідав Париж. У 1886 році в Осло були показані 4 картини Е. Мунка, в
          тому числі, перша версія «Хворої дівчинки», що викликало неоднозначну
          реакцію критиків і публіки.
          <hr></hr>
          Після першої персональної виставки у 1889 році Едвард Мунк отримав
          державну стипендію і виїхав на студії (від італ. studere — навчання)
          до Парижа, де почав працювати в студії Леона Бонната (фр. Léon
          Bonnat). У цьому ж році помер батько Мунка. Будинок Едварда Мунка в
          Осґордштранді У 1890-1892 роках жив у Парижі, відвідав Ніццу, місяць
          щоліта жив у власному домі в Осґордштранді (Åsgårdstrand) над фйордом
          Осло у рідній Норвегії. У 1892 році знову виставлявся в Осло, його
          запросили виставити свої картини у Verein Berliner Künstler (Берлін,
          Німеччина), однак пропрацювавши тиждень, виставку довелось закрити з
          причини значних протестів громадськості.
        </p>
        <img src={edwardImg} alt="Едвард Мунк" />
      </div>
    </div>
  );
}
export default Biography;
